#include "win.h"

int win(char *matrix[SIZE][SIZE])
{
	int winner = 0;
/////////////////////////////////////////////////////////////
	if ((matrix[0][0] == 'X') && (matrix[0][1] == 'X') && (matrix[0][2] == 'X')){
		printf("Первый игрок выиграл!\n");
		winner = 1;	
	}

	if ((matrix[0][0] == 'O') && (matrix[0][1] == 'O') && (matrix[0][2] == 'O')){
		printf("Второй игрок выиграл!\n");
		winner = 1;		
	}
/////////////////////////////////////////////////////////////
	if ((matrix[1][0] == 'X') && (matrix[1][1] == 'X') && (matrix[1][2] == 'X')){
		printf("Первый игрок выиграл!\n");
		winner = 1;		
	}

	if ((matrix[1][0] == 'O') && (matrix[1][1] == 'O') && (matrix[1][2] == 'O')){
		printf("Второй игрок выиграл!\n");
		winner = 1;		
	}
/////////////////////////////////////////////////////////////
	if ((matrix[2][0] == 'X') && (matrix[2][1] == 'X') && (matrix[2][2] == 'X')){
		printf("Первый игрок выиграл!\n");
		winner = 1;		
	}

	if ((matrix[2][0] == 'O') && (matrix[2][1] == 'O') && (matrix[2][2] == 'O')){
		printf("Второй игрок выиграл!\n");
		winner = 1;		
	}
/////////////////////////////////////////////////////////////
	if ((matrix[0][0] == 'X') && (matrix[1][0] == 'X') && (matrix[2][0] == 'X')){
		printf("Первый игрок выиграл!\n");
		winner = 1;		
	}

	if ((matrix[0][0] == 'O') && (matrix[1][0] == 'O') && (matrix[2][0] == 'O')){
		printf("Второй игрок выиграл!\n");
		winner = 1;		
	}
/////////////////////////////////////////////////////////////
	if ((matrix[0][1] == 'X') && (matrix[1][1] == 'X') && (matrix[2][1] == 'X')){
		printf("Первый игрок выиграл!\n");
		winner = 1;		
	}

	if ((matrix[0][1] == 'O') && (matrix[1][1] == 'O') && (matrix[2][1] == 'O')){
		printf("Второй игрок выиграл!\n");
		winner = 1;		
	}
/////////////////////////////////////////////////////////////
	if ((matrix[0][2] == 'X') && (matrix[1][2] == 'X') && (matrix[2][2] == 'X')){
		printf("Первый игрок выиграл!\n");
		winner = 1;		
	}

	if ((matrix[0][2] == 'O') && (matrix[1][2] == 'O') && (matrix[2][2] == 'O')){
		printf("Второй игрок выиграл!\n");
		winner = 1;		
	}
/////////////////////////////////////////////////////////////
	if ((matrix[0][0] == 'X') && (matrix[1][1] == 'X') && (matrix[2][2] == 'X')){
		printf("Первый игрок выиграл!\n");
		winner = 1;		
	}

	if ((matrix[0][0] == 'O') && (matrix[1][1] == 'O') && (matrix[2][2] == 'O')){
		printf("Второй игрок выиграл!\n");
		winner = 1;		
	}
/////////////////////////////////////////////////////////////
	if ((matrix[0][2] == 'X') && (matrix[1][1] == 'X') && (matrix[2][0] == 'X')){
		printf("Первый игрок выиграл!\n");
		winner = 1;		
	}

	if ((matrix[0][2] == 'O') && (matrix[1][1] == 'O') && (matrix[2][0] == 'O')){
		printf("Второй игрок выиграл!\n");
		winner = 1;		
	}
/////////////////////////////////////////////////////////////
	if ((winner == 0) && (((matrix[0][0] == 'X') || (matrix[0][0] == 'O')) 
		&& ((matrix[0][1] == 'X') || (matrix[0][1] == 'O')) 
		&& ((matrix[0][2] == 'X') || (matrix[0][2] == 'O')) 
		&& ((matrix[1][0] == 'X') || (matrix[1][0] == 'O')) 
		&& ((matrix[1][1] == 'X') || (matrix[1][1] == 'O')) 
		&& ((matrix[1][2] == 'X') || (matrix[1][2] == 'O')) 
		&& ((matrix[2][0] == 'X') || (matrix[2][0] == 'O')) 
		&& ((matrix[2][1] == 'X') || (matrix[2][1] == 'O')) 
		&& ((matrix[2][2] == 'X') || (matrix[2][2] == 'O')))){
		printf("Ничья!\n");
		winner = 1;
	}
	return winner;
}